Repository: sys27/xFunc
Catalog: xFunc.Maths/Resources/Resource.*.resx
Languages: ru

# ConstError
source: You can't change constants.
ru: Вы не можете изменять константы.

# ErrorWhileParsingTree
source: An error occurred while parsing the tree.
ru: При построении дерева произошла ошибка.

# LessParams
source: The number of parameters is less than expected.
ru: Количество параметров меньше, чем ожидается.

# MatrixArgException
source: The size of matrices is invalid.
ru: Неправильные размеры матриц.

# MoreParams
source: The number of parameters is more than expected.
ru: Количество параметров больше, чем ожидается.

# NotSpecifiedFunction
source: The function is not specified.
ru: Функция не задана.

# NotSupportedSymbol
source: The symbol '{0}' is not supported.
ru: Символ '{0}' не поддерживается программой.

# ReadOnlyError
source: You cannot change the read-only variable.
ru: Вы не можете изменить параменты, которые предназначены только для чтения.

# VariableNotFoundExceptionError
source: The '{0}' variable not found.
ru: Переменная '{0}' не найдена.

# ParameterTypeMismatchExceptionError
source: Parameter type mismatch (Expected: {0}; Actual: {1}).
ru: Несоответствующий тип параметра (Ожидается: {0}; Фактически: {1}).

# VectorCrossException
source: The size of vector should equal to 3.
ru: Размер вектора должен быть равер 3.

# DifferentParameterTypeMismatchExceptionError
source: The parameter #{2} has wrong type (Expected: {0}; Actual: {1}).
ru: Параметр #{2} имеет не соответствующий тип (Ожидается: {0}; Фактически: {1}).

# LeftParameterTypeMismatchExceptionError
source: The left parameter has wrong type (Expected: {0}; Actual: {1}).
ru: Левый параметр имеет не соответствующий тип (Ожидается: {0}; Фактически: {1}).

# RightParameterTypeMismatchExceptionError
source: The right parameter has wrong type (Expected: {0}; Actual: {1}).
ru: Правый параметр имеет не соответствующий тип (Ожидается: {0}; Фактически: {1}).

# MatrixCloseBraceParseException
source: The matrix declaration should end with the '}' symbol.
ru: Объявление матрицы должно заканчиваться символом '}'.

# MatrixCommaParseException
source: Expressions in matrix should be separated by the ',' symbol.
ru: Выражения в матрице должны быть разделены символом ','.

# VectorCloseBraceParseException
source: The vector declaration should end with the '}' symbol.
ru: Объявление вектора должно заканчиваться символом '}'.

# VectorCommaParseException
source: Expressions in vector should be separated by the ',' symbol.
ru: Выражения в векторе должны быть разделены символом ','.

# PhaseParseException
source: The phase of complex number is expected after the '∠' symbol.
ru: Аргумент комплексного числа ожидается после символа '∠'.

# DegreeComplexNumberParseException
source: The '°' symbol is required in polar complex number form.
ru: Символ '°' обязателен для полярной формы комплексного числа.

# ExponentParseException
source: Cannot parse an exponent.
ru: Показатель степени не может быть распарсен.

# SecondOperandParseException
source: Cannot parse second operand of '{0}' operator.
ru: Второй операнд, оператора '{0}', не может быть распарсен.

# FunctionOpenParenthesisParseException
source: The '(' symbol is expected after '{0}' definition.
ru: Ожидается символ '(' после объявления '{0}'.

# FunctionCloseParenthesisParseException
source: The ')' symbol is expected at the end of '{0}' definition.
ru: Ожидается символ ')' в конце объявления '{0}'.

# AssignKeyParseException
source: Cannot parse assignment key.
ru: Ключ не может быть распарсен.

# DefValueParseException
source: Cannot parse value of 'def' expression.
ru: Значение 'def' выражения не может быть распарсено.

# IfConditionParseException
source: Cannot parse condition of 'if' expression.
ru: Условие в 'if' выражении не может быть распарсено.

# IfThenParseException
source: Cannot parse 'then' statement of 'if' expression.
ru: 'then' в 'if' выражении не может быть распарсено.

# IfElseParseException
source: Cannot parse 'else' statement of 'if' expression.
ru: 'else' в 'if' выражении не может быть распарсено.

# ForBodyParseException
source: Cannot parse body of 'for' expression.
ru: Тело выражения 'for' не может быть распарсено.

# ForInitParseException
source: Cannot parse initializer of 'for' expression.
ru: Инициализатор в 'for' выражении не может быть распарсено.

# ForConditionParseException
source: Cannot parse condition of 'for' expression.
ru: Условие в 'for' выражении не может быть распарсено.

# ForIterParseException
source: Cannot parse iterator of 'for' expression.
ru: Итератор в 'for' выражении не может быть распарсено.

# WhileBodyParseException
source: Cannot parse body of 'while' expression.
ru: Тело выражения 'while' не может быть распарсено.

# WhileConditionParseException
source: Cannot parse condition of 'while' expression.
ru: Условие в 'while' выражении не может быть распарсено.

# CommaParseException
source: The comma symbol (',') is expected after '{0}' expression.
ru: Запятая (',') ожидается после выражения '{0}'.

# CloseParenParseException
source: The ')' symbol is expected after '{0}' expression.
ru: Скобка (')') ожидается после выражения '{0}'.

# ParameterListCloseParseException
source: The parameter list should end with ')' symbol.
ru: Список параметров должен заканчиваться символом ')'.

# ResultIsNotSupported
source: The result of evaluation is not supported ('{0}').
ru: Результат вычислений не поддерживается (Функция: '{0}({1})').

# ValueIsNotInteger
source: The value is not an integer.
ru: Значение не является целым числом.

# TernaryElseParseException
source: Cannot parse 'else' statement of ternary operator.
ru: 'else' в тернарном операторе не может быть распарсено.

# TernaryThenParseException
source: Cannot parse 'then' statement of ternary operator.
ru: 'then' в тернарном операторе не может быть распарсено.

# TernaryColonParseException
source: The ':' symbol is expected 'then' expression.
ru: Ожидается символ ':' после выражения 'then'.

# VectorEmptyError
source: The vector should not be empty.
ru: Вектор не может быть пустым.

# MissingExpParseException
source: Cannot parse an expression after the comma symbol.
ru: Выражение не может быть распарсено после символа запятой.

# StringTokenizeException
source: Cannot find the end of string expression.
ru: Конец строки не найден.

# UnitIsNotSupportedException
source: The '{0}' unit is not supported.
ru: Единица измерения '{0}' не поддерживается.

# ValueIsNotSupportedException
source: The '{0} ({1})' conversion value is not supported.
ru: Значение для конвертирования '{0} ({1})' не поддерживается.
