Repository: sys27/xFunc
Catalog: xFunc/Resources/Resource.*.resx
Languages: ru, uk

# AboutButtonHeader
source: About
ru: О программе
uk: Про програму

# AboutButtonToolTip
source: Show the about window
ru: Открыть окно "О программе"
uk: Відкрити вікно "Про програму"

# AboutWindowTitle
source: About
ru: О программе
uk: Про програму

# AdditionalMathExpanderHeader
source: Additional
ru: Дополнительные
uk: Додаткові

# AnglesGroupHeader
source: Angles
ru: Меры измерения углов
uk: Одиниці виміру кутів

# AnswerTextBox
source: Answer:
ru: Ответ:
uk: Рішення:

# Author
source: Dmitry Kischenko
ru: Дмитрий Кищенко
uk: Дмитро Кіщенко

# AuthorTextBox
source: Author:
ru: Разработчик:
uk: Розробник:

# ClipboardGroupHeader
source: Clipboard
ru: Буфер обмена
uk: Буфер обміну

source: cm
ru: см
uk: см

# ConstantsExpanderHeader
source: Constants
ru: Константы
uk: Констати

# CopyButtonHeader
source: Copy
ru: Копировать
uk: Копіювати

# CopyScreenTipText
source: Copy the selected text
ru: Скопировать выделенный текст
uk: Скопіювати виділений текст

# CopyScreenTipTitle
source: Copy (Ctrl+C)
ru: Копировать (Ctrl+C)
uk: Копіювати (Ctrl+C)

# CutButtonHeader
source: Cut
ru: Вырезать
uk: Вирізати

# CutScreenTipText
source: Cut the selected text
ru: Вырезать выделенный текст
uk: Вирізати виділений текст

# CutScreenTipTitle
source: Cut (Ctrl+X)
ru: Вырезать (Ctrl+X)
uk: Вирізати (Ctrl+X)

# DegreeButtonHeader
source: Dergee
ru: Градусы
uk: Градуси

# DegreeScreenTipText
source: Use degrees as a unit of angle measure
ru: Использовать градусы как единицы измерения углов
uk: Використовувати градуси як одиниці виміру кутів

# DegreeScreenTipTitle
source: Degree (Ctrl+Alt+D)
ru: Градусы (Ctrl+Alt+D)
uk: Градуси (Ctrl+Alt+D)

# ExpressionsTextBox
source: Expressions:
ru: Графики:
uk: Графіки:

# ExpressionTextBox
source: Expression:
ru: Выражение:
uk: Вираз:

# GradianButtonHeader
source: Gradian
ru: Грады
uk: Гради

# GradianScreenTipText
source: Use gradians as a unit of angle measure
ru: Использовать грады как единицы измерения углов
uk: Використовувати гради як одиниці виміру кутів

# GradianScreenTipTitle
source: Gradian (Ctrl+Alt+G)
ru: Грады (Ctrl+Alt+G)
uk: Гради (Ctrl+Alt+G)

# GraphsTab
source: Graphs
ru: Графики
uk: Графіки

# HomePageTextBox
source: Home Page:
ru: Сайт:
uk: Сайт:

# HomeRibbonTabHeader
source: Home
ru: Главная
uk: Головна

# HyperbolicExpanderHeader
source: Hyperbolic
ru: Гиперболические
uk: Гіперболічні

# IndexOutOfRangeExceptionError
source: Perhaps, variables have entered incorrectly.
ru: Возможно, переменные были введены неправильно.
uk: Можливо, змінні були введені неправильно.

# LogicTab
source: Logic Expressions
uk: Логічні

# MathTab
source: Math Expressions
ru: Выражения
uk: Математичні

# NotSupportedOperationError
source: This operation is not supported.
ru: Указанная операция не поддерживается.
uk: Вказана операція не підтримується.

# NumberAndArithmeticExpanderHeader
source: Numbers & Arithmetic
ru: Числа и арифметические
uk: Числа та арифметичні

# PasteButtonHeader
source: Paste
ru: Вставить
uk: Вставити

# PasteScreenTipText
source: Paste text from clipboard
ru: Вставить текст с буфера обмена
uk: Вставити текст з буфера обміну

# PasteScreenTipTitle
source: Paste (Ctrl+V)
ru: Вставить (Ctrl+V)
uk: Вставити (Ctrl+V)

# RadianButtonHeader
source: Radian
ru: Радианы
uk: Радіани

# RadianScreenTipText
source: Use radians as a unit of angle measure
ru: Использовать радианы как единицы измерения углов
uk: Використовувати радіани як одиниці виміру кутів

# RadianScreenTipTitle
source: Radian (Ctrl+Alt+R)
ru: Радианы (Ctrl+Alt+R)
uk: Радіани (Ctrl+Alt+R)

# RedoButtonHeader
source: Redo
ru: Вернуть
uk: Повтор

# RedoScreenTipText
source: Redo the last change
ru: Вернуть последнее изменение
uk: Повторити останню дію

# RedoScreenTipTitle
source: Redo (Ctrl+Y)
ru: Вернуть (Ctrl+Y)
uk: Повтор (Ctrl+Y)

# ShowGridCheckBox
source: Show Grid
ru: Показать сетку
uk: Показати сітку

# StandartExpanderHeader
source: Standart
ru: Стандартные
uk: Стандартні

# TrigonometricExpanderHeader
source: Trigonometric
ru: Тригонометрические
uk: Тригонометричні

# TruthTableTab
source: Truth Table
ru: Таблица истинности
uk: Таблиця істинності

# UndoButtonHeader
source: Undo
ru: Отмена
uk: Відміна

# UndoScreenTipText
source: Undo the last change
ru: Отменить последнее изменение
uk: Відмінити останню дію

# UndoScreenTipTitle
source: Undo (Ctrl+Z)
ru: Отмена (Ctrl+Z)
uk: Відміна (Ctrl+Z)

# VariableNotFoundExceptionError
source: The variable not found.
ru: Переменная не найдена.
uk: Змінна не знайдена.

# VersionTextBox
source: Version:
ru: Версия:
uk: Версія:

# BitwiseExpanderHeader
source: Bitwise
ru: Битовые и логические
uk: Бітові

# ClearButtonHeader
source: Clear
ru: Очистить
uk: Очистити

# ClearScreenTipText
source: Delete all expressions.
ru: Удалить все выражения из списка.
uk: Видалити всі вирази зі списку.

# ClearScreenTipTitle
source: Clear
ru: Очистить (Shift+Del)
uk: Очистити

# DeleteExpButtonHeader
source: Delete
ru: Удалить
uk: Видалити

# DeleteExpScreenTipText
source: Delete the selected expression
ru: Удалить выделенное выражение
uk: Видалити виділений вираз

# DeleteExpScreenTipTitle
source: Delete
ru: Удалить (Del)
uk: Видалити

# ExpListGroupHeader
source: Expression List
ru: Список выражений
uk: Список виразів

# CopyAnswerMenuItem
source: Copy "Answer"
ru: Копировать "Ответ"
uk: Копіювати "Відповідь"

# CopyExpressionMenuItem
source: Copy "Expression"
ru: Копировать "Выражение"
uk: Копіювати "Вираз"

# DeleteMenuItem
source: Delete
ru: Удалить
uk: Видалити

# ToClipboardMenuItem
source: To Clipboard
ru: В буфер обмена
uk: До буфера обміну

# ToInputMenuItem
source: To Input
ru: В поле для ввода
uk: У поле для введеня

# AdditionalLogicExpanderHeader
source: Additional
uk: Додаткові

# AssignFunction
source: The expression '{1}' was assigned to the function '{0}'.
ru: Функции '{0}' присвоено выражение '{1}'.
uk: Функції '{0}' присвоєно вираз "{1} '.

# AssignVariable
source: The value '{1}' was assigned to the variable '{0}'.
ru: Переменной '{0}' присвоено '{1}' значение.
uk: Змінній '{0}' присвоєно '{1}' значення.

# UndefineFunction
source: The '{0}' function is removed.
ru: Функция '{0}' удалена.
uk: Функція '{0}' видалена.

# UndefineVariable
source: The '{0}' variable is removed.
ru: Переменная '{0}' удалена.
uk: Змінна '{0}' видалена.

# AvailableUpdate
source: An update is available.
ru: Доступно обновление.
uk: Доступно оновлення.

# VariablesTitle
source: Variables
ru: Переменные
uk: Змінні

# AnswerBaseGroupHeader
source: Answer Base
ru: Система счисления
uk: Система числення

# FunctionButtonHeader
source: Functions
ru: Функции
uk: Функції

# ParamGroupHeader
source: Expression Parameters
uk: Параметри виразу.

# VariablesButtonHeader
source: Variables
ru: Переменные
uk: Змінні

# FunctionsTitle
source: Functions
ru: Функции
uk: Функції

# FuncNameHeader
source: Name
ru: Имя
uk: Ім'я

# FuncValueHeader
source: Value
ru: Значение
uk: Значення

# VarNameHeader
source: Name
ru: Имя
uk: Ім'я

# VarValueHeader
source: Value
ru: Значение
uk: Значення

# FuncScreenTitText
source: Shows the window with all entered functions.
ru: Отображает окно со всеме введенными функциями.
uk: Відображає вікно з усіма введеними функціями.

# FuncScreenTitTitle
source: Functions
ru: Функции (Ctrl+Alt+F)
uk: Функції

# VarScreenTitText
source: Shows the window with all entered variables.
ru: Отображает окно со всеме введенными переменными.
uk: Відображає вікно з усіма введеними змінними.

# VarScreenTitTitle
source: Variables
ru: Переменные (Ctrl+Alt+V)
uk: Змінні

# ArccosecantToolTip
source: Inverse cosecant of a number. Example: arccsc(90) or arccosec(90)
ru: Арккосеканс числа. Пример: arccsc(90) или arccosec(90)
uk: Арккосеканс числа. Приклад: arccsc(90) або arccosec(90)

# ArccosineToolTip
source: Inverse cosine of a number. Example: arccos(90)
ru: Арккосинус числа. Пример: arccos(90)
uk: Арккосинус числа. Приклад: arccos(90)

# ArccotangentToolTip
source: Inverse cotangent of a number. Example: arccot(90) or arcctg(90)
ru: Арккотангенс числа. Пример: arccot(90) или arcctg(90)
uk: Арккотангенс числа. Приклад: arccot(90) або arcctg(90)

# ArcsecantToolTip
source: Inverse secant of a number. Example: arcsec(90)
ru: Арксеканс числа. Пример: arcsec(90)
uk: Арксеканс числа. Приклад: arcsec(90)

# ArcsineToolTip
source: Inverse sine of a number. Example: arcsin(1)
ru: Арксинус числа. Пример: arcsin(1)
uk: Арксинус числа. Приклад: arcsin(1)

# ArctangentToolTip
source: Inverse tangent of a number. Example: arctan(90) or arctg(90)
ru: Арктангенс числа. Пример: arctan(90) или arctg(90)
uk: Арктангенс числа. Приклад: arctan(90) або arctg(90)

# CosecantToolTip
source: Cosecant of a number. Example: csc(90) or cosec(90)
ru: Косеканс числа. Пример: csc(90) или cosec(90)
uk: Косеканс числа. Приклад: csc(90) або cosec(90)

# CosineToolTip
source: Cosine of a number. Example: cos(90)
ru: Косинус числа. Пример: cos(90)
uk: Косинус числа. Приклад: cos(90)

# CotangentToolTip
source: Cotangent of a number. Example: cot(90) or ctg(90)
ru: Котангенс числа. Пример: cot(90) или ctg(90)
uk: Котангенс числа. Приклад: cot(90) або ctg(90)

# SecantToolTip
source: Secant of a number. Example: sec(90)
ru: Секанс числа. Пример: sec(90)
uk: Секанс числа. Приклад: sec(90)

# SineToolTip
source: Sine of a number. Example: sin(90)
ru: Синус числа. Пример: sin(90)
uk: Синус числа. Приклад: sin(90)

# TangentToolTip
source: Tangent of a number. Example: tan(90) or tg(90)
ru: Тангенс числа. Пример: tan(90) или tg(90)
uk: Тангенс числа. Приклад: tan(90) або tg(90)

# AbsToolTip
source: Absolute value of "x". Example: abs(-1)
ru: Модуль "x". Пример: abs(-1)
uk: Модуль "x". Приклад: abs(-1)

# NthRootToolTip
source: nth root of "x". Example: root(27, 3)
ru: Корень n-ой степени от "x". Пример: root(27, 3)
uk: Корінь n-ого ступеня від "x". Приклад: root(27, 3)

# PowerOfTwoToolTip
source: "x" raised to the power of 2. Example: 7^2
ru: "x" в степени 2. Пример: 7^2
uk: "x" в ступені 2. Приклад: 7^2

# PowerOfYToolTip
source: "x" raised to the power of "y". Example: 7^4
ru: "x" в степени "y". Пример: 7^4
uk: "x" в ступені "y". Приклад: 7^4

# SquareRootToolTip
source: Square root of "x". Example: sqrt(9)
ru: Квадратный корень от "x". Пример: sqrt(9)
uk: Квадратний корінь від "x". Приклад: sqrt(9)

# LgToolTip
source: Logarithm to base 10 of "x". Example: lg(3)
ru: Логарифм по основанию 10 числа "x". Пример: lg(3)
uk: Логарифм за основою 10 числа "x". Приклад: lg(3)

# LnToolTip
source: Natural logarithm of "x". Example: ln(10)
ru: Натуральный логарифм числа "x". Пример: ln(10)
uk: Натуральный логарифм числа "x". Приклад: ln(10)

# LogToolTip
source: Logarigthm to base "y" of "x". Example: log(2, 4)
ru: Логарифм по основанию "y" чиста "x". Пример: log(2, 4)
uk: Логарифм за основою "y" чиста "x". Приклад: log(2, 4)

# ArcoshToolTip
source: Inverse hyperbolic cosine of "x". Example: arcosh(90) or arch(90)
ru: Обратный гиперболический косинус числа "x". Пример: arcosh(90) или arch(90)
uk: Зворотний гіперболічний косинус числа "x". Приклад: arcosh(90) або arch(90)

# ArcothToolTip
source: Inverse hyperbolic cotangent of "x". Example: arcoth(90) or arcth(90)
ru: Обратный гиперболический котангенс числа "x". Пример: arcoth(90) или arcth(90)
uk: Зворотний гіперболічний котангенс числа "x". Приклад: arcoth(90) або arcth(90)

# ArcschToolTip
source: Inverse hyperbolic cosecant of "x". Example: arcsch(90)
ru: Обратный гиперболический косеканс числа "x". Пример: arcsch(90)
uk: Зворотний гіперболічний косеканс числа "x". Приклад: arcsch(90)

# ArsechToolTip
source: Inverse hyperbolic secant of "x". Example: arsech(90)
ru: Обратный гиперболический секанс числа "x". Пример: arsech(90)
uk: Зворотний гіперболічний секанс числа "x". Приклад: arsech(90)

# ArsinhToolTip
source: Inverse hyperbolic sine of "x". Example: arsinh(90) or arsh(90)
ru: Обратный гиперболический синус числа "x". Пример: arsinh(90) или arsh(90)
uk: Зворотний гіперболічний синус числа "x". Приклад: arsinh(90) або arsh(90)

# ArtanhToolTip
source: Inverse hyperbolic tangent of "x". Example: artanh(90) or arth(90)
ru: Обратный гиперболический тангенс числа "x". Пример: artanh(90) или arth(90)
uk: Зворотний гіперболічний тангенс числа "x". Приклад: artanh(90) або arth(90)

# CoshToolTip
source: Hyperbolic cosine of "x". Example: cosh(90) or ch(90)
ru: Гиперболический косинус числа "x". Пример: cosh(90) или ch(90)
uk: Гіперболічний косинус числа "x". Приклад: cosh(90) або ch(90)

# CothToolTip
source: Hyperbolic cotangent of "x". Example: coth(90) or cth(90)
ru: Гиперболический котангенс числа "x". Пример: coth(90) или cth(90)
uk: Гіперболічний котангенс числа "x". Приклад: coth(90) або cth(90)

# CschToolTip
source: Hyperbolic cosecant of "x". Example: csch(90)
ru: Гиперболический косеканс числа "x". Пример: csch(90)
uk: Гіперболічний косеканс числа "x". Приклад: csch(90)

# SechToolTip
source: Hyperbolic secant of "x". Example: sech(90)
ru: Гиперболический секанс числа "x". Пример: sech(90)
uk: Гіперболічний секанс числа "x". Приклад: sech(90)

# SinhToolTip
source: Hyperbolic sine of "x". Example: sinh(90) or sh(90)
ru: Гиперболический синус числа "x". Пример: sinh(90) или sh(90)
uk: Гіперболічний синус числа "x". Приклад: sinh(90) або sh(90)

# TanhToolTip
source: Hyperbolic tangent of "x". Example: tanh(90) or th(90)
ru: Гиперболический тангенс числа "x". Пример: tanh(90) или th(90)
uk: Гіперболічний тангенс числа "x". Приклад: tanh(90) або th(90)

# AndToolTip
source: Bitwise AND operation. This operation rounds a rational number. Example: x and y, x & y
ru: Побитовая операция И. Пример: x and y, x & y
uk: Побітова операція І. Ця операція округлює раціональне число. Приклад: x and y, x & y

# DefToolTip
source: Assigns the value to specified variable or creates an user-function. Example: x := 1, f(x) := sin(x)
ru: Назначает значение переменной или пользовательской функции. Пример: x := 1, f(x) := sin(x)
uk: Призначає значення змінній або функції користувача. Приклад: x := 1, f(x) := sin(x)

# ExitMenu
source: Exit
ru: Выход
uk: Вихід

# ExitToolTip
source: Closes the application.
ru: Закрыть приложение.
uk: Закрити додаток.

# FileMenu
source: File
ru: Файл
uk: Файл

# NewMenu
source: New
ru: Новый
uk: Новий

# NotToolTip
source: Bitwise NOT operation. This operation rounds a rational number. Example: not(3)
ru: Побитовая операция НЕ. Пример: not(3)
uk: Побітова операція НЕ. Ця операція округлює раціональне число. Приклад: not(3)

# OpenMenu
source: Open
ru: Открыть
uk: Відкрити

# OrToolTip
source: Bitwise OR operation. This operation rounds a rational number. Example: x or y, x | y
ru: Побитовая операция ИЛИ. Пример: x or y, x | y
uk: Побітова операція АБО. Ця операція округлює раціональне число. Приклад: x or y, x | y

# SaveMenu
source: Save
ru: Сохранить
uk: Зберегти

# SettingsMenu
source: Settings
ru: Настройки
uk: Налаштування

# SimplifyToolTip
source: Simplifies the specified expression. Example: simplify(arcsin(sin(x)))
ru: Упрощает выражение. Пример: simplify(arcsin(sin(x)))
uk: Спрощує вираз. Приклад: simplify(arcsin(sin(x)))

# UndefToolTip
source: Removes the specified variable or user-function. Example: undef(x)
ru: Удаляет переменную или пользовательскую функцию. Пример: undef(x)
uk: Видаляє змінні або функції користувача. Приклад: undef(x)

# XOrToolTip
source: Bitwise XOR operation. This operation rounds a rational number. Example: x xor y
ru: Побитовая операция Исключащее ИЛИ. Пример: x xor y
uk: Побітова операція Виключне АБО. Ця операція округлює раціональне число. Приклад: x xor y

# SettingsCancel
source: Cancel
ru: Отмена
uk: Скасувати

# SettingsSave
source: Save
ru: Сохранить
uk: Зберегти

# SettingsToolTip
source: Shows settings of program.
ru: Отображает настройки программы.
uk: Відображає налаштування програми.

# SettingsViewTitle
source: Settings
ru: Настройки
uk: Налаштування

# SettingsAngle
source: Default _angle measurement:
ru: Единицы измерения угла по умолчанию:
uk: Одиниці виміру кута за замовчуванням:

# SettingsAutoLang
source: Automatic
ru: Автоматически
uk: Автоматично

# SettingsBin
source: Binary
ru: Двоичная
uk: Двійкова

# SettingsCheckUpdates
source: Check for updates.
ru: Проверять обновления.
uk: Перевіряти оновлення.

# SettingsDec
source: Decimal
ru: Десятичная
uk: Десяткова

# SettingsDegree
source: Degree
ru: Градусы
uk: Градуси

# SettingsGradian
source: Gradian
ru: Грады
uk: Гради

# SettingsHex
source: Hexadecimal
ru: Шестнадцатеричная
uk: Шістнадцяткова

# SettingsLanguageLabel
source: _Language*:
ru: Язык*:
uk: Мова*:

# SettingsMaxNumber
source: Maximum number of expressions:
ru: Максимальное количество выражений:
uk: Максимальна кількість виразів:

# SettingsNumber
source: Default _number base:
ru: Система счисления по умолчанию:
uk: Система числення за замовчуванням:

# SettingsOct
source: Octal
ru: Восьмеричная
uk: Вісімкова

# SettingsRadian
source: Radian
ru: Радианы
uk: Радіани

# SettingsRemember
source: _Remember number base and angle measurement
ru: Запоминать систему счисления и единицы измерения угла
uk: Запам'ятовувати систему числення і одиниці вимірювання кута

# SettingsRightToolBar
source: Remember right _tool bar state.
ru: Запоминать состояние правой панели инструментов.
uk: Запам'ятовувати стан правої панелі інструментів.

# SettingsWindowPos
source: Remember window state and _position.
ru: Запоминать состояние окна и его позицию.
uk: Запам'ятовувати стан вікна і його позицію.

# SettingsReset
source: Reset
ru: Сбросить настройки
uk: Скинути

# SettingsLanguageToolTip
source: The language will be set after program restart.
ru: Язык будет изменен после перезапуска программы.
uk: Мова буде змінена після перезапуску програми.

# AboutToolTipTitle
source: About (F1)
ru: О программе (F1)
uk: Про програму (F1)

# ExitToolTipTitle
source: Exit (Alt+F4)
ru: Выход (Alt+F4)
uk: Вихід (Alt+F4)

# SettingsToolTipTitle
source: Settings (Alt+S)
ru: Настройки (Alt+S)
uk: Налаштування (Alt+S)

# MathParameterType_Constant
source: Constants
uk: Константи

# MathParameterType_Normal
source: Normal
uk: Звичайні

# MathParameterType_ReadOnly
source: ReadOnly
uk: Тільки для читання

# AddVarCancel
source: Cancel
ru: Отмена
uk: Відміна

# AddVarName
source: _Name:
ru: _Имя:
uk: _Ім'я:

# AddVarOK
source: OK
ru: ОК
uk: ОК

# AddVarReadOnly
source: _Read-Only
ru: _Только для чтения
uk: _Тільки для читання

# AddVarTitle
source: Add a new variable
ru: Добавить переменную
uk: Додати змінну

# AddVarValue
source: _Value:
ru: _Значение:
uk: _Значення:

# AddFuncCancel
source: Cancel
ru: Отмена
uk: Відміна

# AddFuncFunc
source: _Function:
ru: _Функция:
uk: _Функція:

# AddFuncName
source: _Name:
ru: _Имя:
uk: _Им'я:

# AddFuncOk
source: OK
ru: ОК
uk: ОК

# AddFuncTitle
source: Add a new function
ru: Добавить функцию
uk: Додати функцію

# ErrorHeader
source: Error
ru: Ошибка
uk: Помилка

# AddFuncError
source: The function name is incorrect.
ru: Имя функции является неправильным.
uk: Ім'я функції є неправильним.

# GCDToolTip
source: Greatest common divisor. Example: gcd(2, 4)
ru: Наибольший общий делитель. Пример: gcd(2, 4)
uk: Найбільший спільний дільник. Приклад: gcd(2, 4)

# LCMToolTip
source: Least common multiple. Example: lcm(2, 4)
ru: Наименьшее общее кратное. Пример: lcm(2, 4)
uk: Найменше спільне кратне. Приклад: lcm(2, 4)

# FactToolTip
source: Factorial. Example: fact(4) or 4!
ru: Факториал. Пример: fact(4) or 4!
uk: Факторіал. Приклад: fact(4) or 4!

# ProductToolTip
source: Product. Example: product(body, from, to, increment, variable)
ru: Произведение. Пример: product(body, from, to, increment, variable)
uk: Добуток. Приклад: product(body, from, to, increment, variable)

# SumToolTip
source: Summation. Example: sum(body, from, to, increment, variable)
ru: Сумма. Пример: sum(body, from, to, increment, variable)
uk: Сума. Приклад: sum(body, from, to, increment, variable)

# MatrixExpanderHeader
source: Matrix
ru: Матрицы
uk: Матриці

# DetToolTip
source: Determinant of a matrix. Example: det({{1, 3}, {9, 4}})
ru: Детерминант матрицы. Пример: det({{1, 3}, {9, 4}})
uk: Детермінант матриці. Приклад: det({{1, 3}, {9, 4}})

# TransposeToolTip
source: Transpose a matrix. Example: transpose({{1, 3}, {9, 4}})
ru: Транспонировать матрицу. Пример: transpose({{1, 3}, {9, 4}})
uk: Транспонувати матрицю. Приклад: transpose({{1, 3}, {9, 4}})

# InverseToolTip
source: Inverse a matrix. Example: inverse({{1, 3}, {9, 4}})
ru: Обратная матрица. Пример: inverse({{1, 3}, {9, 4}})
uk: Зворотній матриця. Приклад: inverse({{1, 3}, {9, 4}})

# RoundToolTip
source: Rounds a value to the nearest integer or to the specified number of fractional digits. Example: round(number, digits).
ru: Функция округления. Пример: round(number, digits).
uk: Функція округлення. Приклад: round(number, digits).

# CeilToolTip
source: Returns the smallest integer greater than or equal to the specified number. Example: ceil(5.5555).
ru: Возвращает наименьшее целое число, которое больше или равно заданному числу. Пример: ceil(5.55555).
uk: Повертає найменше ціле число, яке більше або дорівнює заданому числу. Приклад: ceil(5.55555).

# FloorToolTip
source: Returns the largest integer less than or equal to the specified number. Example: floor(5.55555).
ru: Возвращает наибольшее целое число, которое меньше или равно указанному числу. Пример: floor(5.55555).
uk: Повертає найбільше ціле число, яке менше або дорівнює вказаному числу. Приклад: floor(5.55555).

# ProgExpanderHeader
source: Programming
ru: Программирование
uk: Програмування

# WhileToolTip
source: The While loop. Example: while(x := x + 1, x < 10).
ru: Цикл while. Пример: while(x := x + 1, x < 10).
uk: Цикл while. Приклад: while(x := x + 1, x < 10).

# ForToolTip
source: The For loop. Example: for(z := z + 1, x := 0, x < 10, x := x + 1).
ru: Цикл for. Пример: for(z := z + 1, x := 0, x < 10, x := x + 1).
uk: Цикл for. Приклад: for(z := z + 1, x := 0, x < 10, x := x + 1).

# IfToolTip
source: The If condition. Example: if(x < 2, sin(x), cos(x)).
ru: Условие if. Пример: if(x < 2, sin(x), cos(x)).
uk: Умова if. Приклад: if(x < 2, sin(x), cos(x)).

# EqualToolTip
source: The equality operator. Example: x == 10.
ru: Оператор равенства. Пример: x == 10.
uk: Оператор рівності. Приклад: x == 10.

# NotEqualToolTip
source: The inequality operator. Example: x != 10.
ru: Оператор неравенства. Пример: x != 10.
uk: Оператор нерівності. Приклад: x != 10.

# LessThanToolTip
source: The "less than" operator. Example: x < 10.
ru: Оператор сравнения "меньше". Пример: x < 10.
uk: Оператор порівняння "менше". Приклад: x <10.

# GreaterThanToolTip
source: The "greater than" operator. Example: x > 10.
ru: Оператор сравнения "больше". Пример: x > 10.
uk: Оператор порівняння "більше". Приклад: x> 10.

# LessOrEqualToolTip
source: The "less or equal than" operator. Example: x <= 10.
ru: Оператор сравнения "меньше или равно". Пример: x <= 10.
uk: Оператор порівняння "менше або дорівнює". Приклад: x <= 10.

# GreaterOrEqualToolTip
source: The "greater or equal than" operator. Example: x >= 10.
ru: Оператор сравнения "больше или равно". Пример: x >= 10.
uk: Оператор порівняння "більше або дорівнює". Приклад: x> = 10.

# ConditionalAndToolTip
source: The conditional-AND operator. Example: x == 0 && y != 0.
ru: Условный оператор И. Пример: x == 0 && y != 0.
uk: Умовний оператор І. Приклад: x == 0 && y != 0.

# ConditionalOrToolTip
source: The conditional-OR operator. Example: x == 0 || y != 0.
ru: Условный оператор ИЛИ. Пример: x == 0 || y != 0.
uk: Умовний оператор АБО. Приклад: x == 0 || y != 0.
